import {useEffect, useState} from "react";

const Schedule = () => {
    const [tournament, setTournament] = useState([])

    useEffect(() => {
        const myTournaments = [
            {
                name: "Чемпіонат Валківської МТГ з класичного волейболу сезону 2023-2024 рр. Друге коло та плей-оф",
                place: "ліцей ім. Масельського О.С.",
                start_date: "13.01.2024",
                end_date: "16.03.2024"
            },
            {
                name: "Кубок \"закриття сезону\" з класичного волейболу на призи Валківського міського голови",
                place: "ліцей ім. Масельського О.С.",
                start_date: "23.03.2024",
                end_date: ""
            },
            {
                name: "Кубок з класичного волейболу серед ветеранських команд \"35+\"",
                place: "ліцей ім. Масельського О.С.",
                start_date: "13.04.2024",
                end_date: ""
            },
            {
                name: "Кубок з класичного волейболу серед молодіжних команд",
                place: "ліцей ім. Масельського О.С.",
                start_date: "20.04.2024",
                end_date: ""
            },
            {
                name: "Кубок пам`яті Семидочного В.М. з класичного волейболу",
                place: "с. Сніжків",
                start_date: "27.04.2024",
                end_date: ""
            },
            {
                name: "Турнір \"відкриття сезону\" з пляжного волейболу 2х2",
                place: "майданчики валківського волейбольного клубу - міський пляж",
                start_date: "1.06.2024",
                end_date: ""
            },
            {
                name: "Турнір \"відкриття сезону\" з паркового волейболу 4х4",
                place: "майданчики валківського волейбольного клубу - міський пляж",
                start_date: "8.06.2024",
                end_date: ""
            },
            {
                name: "Чемпіонат та плей-оф Валківської МТГ з паркового волейболу 4х4",
                place: "майданчики валківського волейбольного клубу - міський пляж",
                start_date: "15.06.2024",
                end_date: "11.08.2024"
            },
            {
                name: "Кубок з паркого волейболу серед молодіжних команд, присвячений міжнародному дню молоді",
                place: "майданчики валківського волейбольного клубу - міський пляж",
                start_date: "10.08.2024",
                end_date: ""
            },
            {
                name: "Турнір \"закриття сезону\" з паркового волейболу 4х4 присвячений Дню Незалежності України на призи Валківського міського голови",
                place: "майданчики валківського волейбольного клубу - міський пляж",
                start_date: "24.08.2024",
                end_date: ""
            },
            {
                name: "Турнір \"закриття сезону\" з пляжного волейболу 2х2",
                place: "ліцей ім. Масельського О.С.",
                start_date: "31.08.2024",
                end_date: ""
            },
            {
                name: "Турнір \"відкриття сезону\" з класичного волейболу",
                place: "ліцей ім. Масельського О.С.",
                start_date: "12.10.2024",
                end_date: ""
            },
            {
                name: "Чемпіонат Валківської МТГ з класичного волейболу сезону 2023-2024 рр. Перше коло",
                place: "ліцей ім. Масельського О.С.",
                start_date: "19.10.2024",
                end_date: "14.12.2024"
            },
        ]

        setTournament(myTournaments)
    }, []);


    return <>
        <div className="text-center">
            <h2>Турніри {(new Date().getFullYear())} року</h2>
            <hr/>
        </div>
        <div className="container">
            {tournament.map((m, key) => (
                <div className="row" key={key}>
                    <div className="col-sm-1">{key + 1}</div>
                    <div className="col">{m.name}</div>
                    <div className="col"> {m.start_date} {m.end_date ? " - " + m.end_date : ""}</div>
                    <div className="col">{m.place}</div>
                </div>
            ))}
        </div>
    </>
}

export default Schedule